import 'package:flutter_k/model/news.dart';

class NewsData {
  NewsData._();

  List<News> news = [
    News(
        id: '1',
        title: 'تعليم الاطفال الاستهلاك الذكي',
        description:
            'الاستهلاك الذكي والمسؤول هو مهارة مهمة في الحياة. أخبروا اطفالكم أين تشترون احتياجاتكم غالبا، كيف تتخذون القرارات المتعلقة بالشراء، وما هي المُنتَجات التي تختارونها.',
        imagePath:
            'assets/images/1.webp',
        date: DateTime.now()),
    News(
        id: '2',
        title: 'الرحلة الرائعة أثناء تطوّر اللغة',
        description:'يشكل تطوّر اللغة لدى الأولاد مرحلة رائعة، وهو مرحلة تطورية ينتظرها الكثير من الآباء بفارغ الصبر. يمكن أن تساعدوا أولادكم على تعلم اللغة بسهولة كبيرة: ببساطة، تحدثوا معهم وأصغوا إليهم.',
        imagePath:
        'assets/images/2.webp',
        date: DateTime.now()),
    News(
        id: '3',
        title: 'مهارات المحادثة لدى الأولاد',
        description:'لقدرة على الكلام والإصغاء للآخرين مهمة للأولاد. فهي تساعدهم في التعرّف إلى الأصدقاء، كسب إصغاء الآخرين، طلب ما يحتاجون إليه، والمشاركة في المجتمع. كلما كبر وتطور الأولاد يتعلمون كيف يمكنهم التحدث والإصغاء. معنى التحدث والإصغاء الإيجابيين هو التحدث بتهذيب وفق الدور، عدم إزعاج الآخرين، والتصرف معهم بآداب.',
        imagePath:
        'assets/images/3.webp',
        date: DateTime.now()),
    News(
        id: '4',
        title: 'مهارات الكتابة لدى الأولاد',
        description:'الكتابة هي مهارة ضرورية وهامة جدًّا. من المهم أن تساعدوا رضيعكم على تطوير مهارات الكتابة منذ سن مبكرة جدا، ليكون جاهزا لتعلم الكتابة بشكل رسمي في المدرسة.',
        imagePath:
        'assets/images/4.webp',
        date: DateTime.now()),
    News(
        id: '5',
        title: 'التعلّم والتطور الإبداعي في سن الروضة',
        description:'هناك دور مركزي للعب الإبداعي والتجارب الفنية التي تثير الخيال في مراحل تطوّر وتعلّم الأولاد في سن الروضة. يمكن تعزيز وتشجيع الإبداع لدى ابنكم بواسطة نشاطات إبداعية حرة وسلسة، واللعب معه.',
        imagePath:
        'assets/images/5.webp',
        date: DateTime.now()),
    News(
        id: '6',
        title: 'تطوّر الأولاد في سن الروضة',
        description:'يكون الأطفال في سن الروضة بأشكال وأحجام مختلفة، ولكن يتطورون وفق المراحل ذاتها منذ سن 3 حتى 4 سنوات. ما المتوقع أن يقوم به ابنكم، كيف يمكنكم مساعدته',
        imagePath:
        'assets/images/6.webp',
        date: DateTime.now()),
  ];

  static NewsData newsData = NewsData._();
}
